music_app/app/models/user.rb

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "[FILTERED]"], ["updated_at", "2022-11-15 22:19:12.907699"], ["id", 1]]
---
    def reset_session_token
        self.session_token = generate_unique_session_token
        self.save!