music_app/app/controllers/bands_controller.rb

SELECT "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_band
        @band = Band.find_by(id: params[:id])